[
  {
    "id": 1,
    "size": 12,
    "title": "Fjallraven - Foldsack No. 1 Backpack, Fits 15 Laptops",
    "price": 100,
    "description": "Your perfect pack for everyday use and walks in the forest. Stash your laptop (up to 15 inches) in the padded sleeve, your everyday",
    "category": "men's clothing",
    "image": "https://fakestoreapi.com/img/81fPKd-2AYL._AC_SL1500_.jpg",
    "material": "Cotton",
    "rating": {
      "rate": 3.9,
      "count": 120
    }
  },
  {
    "id": 2,
    "size": 50,
    "title": "Mens Casual Premium Slim Fit T-Shirts ",
    "price": 200,
    "description": "Slim-fitting style, contrast raglan long sleeve, three-button henley placket, light weight & soft fabric for breathable and comfortable wearing. And Solid stitched shirts with round neck made for durability and a great fit for casual fashion wear and diehard baseball fans. The Henley style round neckline includes a three-button placket.",
    "category": "men's clothing",
    "image": "https://fakestoreapi.com/img/71-3HjGNDUL._AC_SY879._SX._UX._SY._UY_.jpg",
    "material": "Wool",
    "rating": {
      "rate": 4.1,
      "count": 259
    }
  },
  {
    "id": 3,
    "size": 40,
    "title": "Mens Cotton Jacket",
    "price": 300,
    "description": "great outerwear jackets for Spring/Autumn/Winter, suitable for many occasions, such as working, hiking, camping, mountain/rock climbing, cycling, traveling or other outdoors. Good gift choice for you or your family member. A warm hearted love to Father, husband or son in this thanksgiving or Christmas Day.",
    "category": "men's clothing",
    "image": "https://fakestoreapi.com/img/71li-ujtlUL._AC_UX679_.jpg",
    "material": "Wool",
    "rating": {
      "rate": 4.7,
      "count": 500
    }
  },
  {
    "id": 4,
    "size": 30,
    "title": "Mens Casual Slim Fit",
    "price": 110,
    "description": "The color could be slightly different between on the screen and in practice. / Please note that body builds vary by person, therefore, detailed size information should be reviewed below on the product description.",
    "category": "men's clothing",
    "image": "https://fakestoreapi.com/img/71YXzeOuslL._AC_UY879_.jpg",
    "material": "polyster",
    "rating": {
      "rate": 2.1,
      "count": 430
    }
  },
  {
    "id": 5,
    "size": 20,
    "title": "John Hardy Women's Legends Naga Gold & Silver Dragon Station Chain Bracelet",
    "price": 600,
    "description": "From our Legends Collection, the Naga was inspired by the mythical water dragon that protects the ocean's pearl. Wear facing inward to be bestowed with love and abundance, or outward for protection.",
    "category": "jewelery",
    "image": "https://fakestoreapi.com/img/71pWzhdJNwL._AC_UL640_QL65_ML3_.jpg",
    "material": "joot",
    "rating": {
      "rate": 4.6,
      "count": 400
    }
  },
  {
    "id": 6,
    "title": "Solid Gold Petite Micropave ",
    "price": 168,
    "description": "Satisfaction Guaranteed. Return or exchange any order within 30 days.Designed and sold by Hafeez Center in the United States. Satisfaction Guaranteed. Return or exchange any order within 30 days.",
    "category": "jewelery",
    "image": "https://fakestoreapi.com/img/61sbMiUnoGL._AC_UL640_QL65_ML3_.jpg",
    "rating": {
      "rate": 3.9,
      "count": 70
    }
  },
  {
    "id": 7,
    "title": "White Gold Plated Princess",
    "price": 9.99,
    "description": "Classic Created Wedding Engagement Solitaire Diamond Promise Ring for Her. Gifts to spoil your love more for Engagement, Wedding, Anniversary, Valentine's Day...",
    "category": "jewelery",
    "image": "https://fakestoreapi.com/img/71YAIFU48IL._AC_UL640_QL65_ML3_.jpg",
    "rating": {
      "rate": 3,
      "count": 400
    }
  },
  {
    "id": 8,
    "title": "Pierced Owl Rose Gold Plated Stainless Steel Double",
    "price": 10.99,
    "description": "Rose Gold Plated Double Flared Tunnel Plug Earrings. Made of 316L Stainless Steel",
    "category": "jewelery",
    "image": "https://fakestoreapi.com/img/51UDEzMJVpL._AC_UL640_QL65_ML3_.jpg",
    "rating": {
      "rate": 1.9,
      "count": 100
    }
  },
  {
    "id": 9,
    "size": "",
    "title": "GABARDINE TRENCH COAT",
    "price": 64,
    "description": "This fully lined gabardine cotton trench coat has a belted, double-breasted design with accent Medusa buttons and structured padded shoulders. Medusa hardware La Greca lining Long sleeves Pointed collar Front and back storm flaps Front button closure Side flap pockets Adjustable belted waist Outer composition: 100% Cotton Lining: 100% Cupro",
    "category": "women's clothing",
    "image": "https://www.versace.com/dw/image/v2/BGWN_PRD/on/demandware.static/-/Sites-ver-master-catalog/default/dwaea3607d/original/90_1011711-1A01718_1KA50_10_GabardineTrenchCoat--Versace-online-store_2_1.jpg?sw=850&q=85&strip=true",
    "rating": {
      "rate": 3.3,
      "count": 203
    }
  },
  {
    "id": 10,
    "title": "SanDisk SSD PLUS 1TB Internal SSD - SATA III 6 Gb/s",
    "price": 109,
    "description": "Easy upgrade for faster boot up, shutdown, application load and response (As compared to 5400 RPM SATA 2.5” hard drive; Based on published specifications and internal benchmarking tests using PCMark vantage scores) Boosts burst write performance, making it ideal for typical PC workloads The perfect balance of performance and reliability Read/write speeds of up to 535MB/s/450MB/s (Based on internal testing; Performance may vary depending upon drive capacity, host device, OS and application.)",
    "category": "electronics",
    "image": "https://fakestoreapi.com/img/61U7T1koQqL._AC_SX679_.jpg",
    "rating": {
      "rate": 2.9,
      "count": 470
    }
  },
  {
    "id": 11,
    "title": "Red Hand Embroidered Zardozi Round Layered Lehenga Set For Women",
    "price": 109,
    "description": "Red georgette double layered lehenga with attached can-can, hand embroidered border in zardozi, sequins & micro crystals. Paired with padded plunged round neck blouse with all booti embellishment & scalloped embroidered dupatta.Red georgette double layered lehenga with attached can-can, hand embroidered border in zardozi, sequins & micro crystals. Paired with padded plunged round neck blouse with all booti embellishment & scalloped embroidered dupatta.Red georgette double layered lehenga with attached can-can, hand embroidered border in zardozi, sequins & micro crystals. Paired with padded plunged round neck blouse with all booti embellishment & scalloped embroidered dupatta.",
    "category": "women's clothing",
    "image": "https://static3.azafashions.com/tr:w-450/uploads/product_gallery/pre2020haseena_19oct2022-0661313001666197750.jpg",
    "rating": {
      "rate": 4.8,
      "count": 319
    }
  },
  {
    "id": 12,
    "title": "WD 4TB Gaming Drive Works with Playstation 4 Portable External Hard Drive",
    "price": 114,
    "description": "Expand your PS4 gaming experience, Play anywhere Fast and easy, setup Sleek design with high capacity, 3-year manufacturer's limited warranty",
    "category": "electronics",
    "image": "https://fakestoreapi.com/img/61mtL65D4cL._AC_SX679_.jpg",
    "rating": {
      "rate": 4.8,
      "count": 400
    }
  },
  {
    "id": 13,
    "title": "Acer SB220Q bi 21.5 inches Full HD (1920 x 1080) IPS Ultra-Thin",
    "price": 599,
    "description": "21. 5 inches Full HD (1920 x 1080) widescreen IPS display And Radeon free Sync technology. No compatibility for VESA Mount Refresh Rate: 75Hz - Using HDMI port Zero-frame design | ultra-thin | 4ms response time | IPS panel Aspect ratio - 16: 9. Color Supported - 16. 7 million colors. Brightness - 250 nit Tilt angle -5 degree to 15 degree. Horizontal viewing angle-178 degree. Vertical viewing angle-178 degree 75 hertz",
    "category": "electronics",
    "image": "https://fakestoreapi.com/img/81QpkIctqPL._AC_SX679_.jpg",
    "rating": {
      "rate": 2.9,
      "count": 250
    }
  },
  {
    "id": 14,
    "title": "Samsung 49-Inch CHG90 144Hz Curved Gaming Monitor (LC49HG90DMNXZA) – Super Ultrawide Screen QLED ",
    "price": 999.99,
    "description": "49 INCH SUPER ULTRAWIDE 32:9 CURVED GAMING MONITOR with dual 27 inch screen side by side QUANTUM DOT (QLED) TECHNOLOGY, HDR support and factory calibration provides stunningly realistic and accurate color and contrast 144HZ HIGH REFRESH RATE and 1ms ultra fast response time work to eliminate motion blur, ghosting, and reduce input lag",
    "category": "electronics",
    "image": "https://fakestoreapi.com/img/81Zt42ioCgL._AC_SX679_.jpg",
    "rating": {
      "rate": 2.2,
      "count": 140
    }
  },
  {
    "id": 15,
    "title": "BIYLACLESEN Women's 3-in-1 Snowboard Jacket Winter Coats",
    "price": 56.99,
    "description": "Note:The Jackets is US standard size, Please choose size as your usual wear Material: 100% Polyester; Detachable Liner Fabric: Warm Fleece. Detachable Functional Liner: Skin Friendly, Lightweigt and Warm.Stand Collar Liner jacket, keep you warm in cold weather. Zippered Pockets: 2 Zippered Hand Pockets, 2 Zippered Pockets on Chest (enough to keep cards or keys)and 1 Hidden Pocket Inside.Zippered Hand Pockets and Hidden Pocket keep your things secure. Humanized Design: Adjustable and Detachable Hood and Adjustable cuff to prevent the wind and water,for a comfortable fit. 3 in 1 Detachable Design provide more convenience, you can separate the coat and inner as needed, or wear it together. It is suitable for different season and help you adapt to different climates",
    "category": "women's clothing",
    "image": "https://fakestoreapi.com/img/51Y5NI-I5jL._AC_UX679_.jpg",
    "rating": {
      "rate": 2.6,
      "count": 235
    }
  },
  {
    "id": 16,
    "title": "Lock and Love Women's Removable Hooded Faux Leather Moto Biker Jacket",
    "price": 29.95,
    "description": "100% POLYURETHANE(shell) 100% POLYESTER(lining) 75% POLYESTER 25% COTTON (SWEATER), Faux leather material for style and comfort / 2 pockets of front, 2-For-One Hooded denim style faux leather jacket, Button detail on waist / Detail stitching at sides, HAND WASH ONLY / DO NOT BLEACH / LINE DRY / DO NOT IRON",
    "category": "women's clothing",
    "image": "https://fakestoreapi.com/img/81XH0e8fefL._AC_UY879_.jpg",
    "rating": {
      "rate": 2.9,
      "count": 340
    }
  },
  {
    "id": 17,
    "title": "Rain Jacket Women Windbreaker Striped Climbing Raincoats",
    "price": 39.99,
    "description": "Lightweight perfet for trip or casual wear---Long sleeve with hooded, adjustable drawstring waist design. Button and zipper front closure raincoat, fully stripes Lined and The Raincoat has 2 side pockets are a good size to hold all kinds of things, it covers the hips, and the hood is generous but doesn't overdo it.Attached Cotton Lined Hood with Adjustable Drawstrings give it a real styled look.",
    "category": "women's clothing",
    "image": "https://fakestoreapi.com/img/71HblAHs5xL._AC_UY879_-2.jpg",
    "rating": {
      "rate": 3.8,
      "count": 679
    }
  },
  {
    "id": 18,
    "title": "MBJ Women's Solid Short Sleeve Boat Neck V ",
    "price": 9.85,
    "description": "95% RAYON 5% SPANDEX, Made in USA or Imported, Do Not Bleach, Lightweight fabric with great stretch for comfort, Ribbed on sleeves and neckline / Double stitching on bottom hem",
    "category": "women's clothing",
    "image": "https://fakestoreapi.com/img/71z3kpMAYsL._AC_UY879_.jpg",
    "rating": {
      "rate": 4.7,
      "count": 130
    }
  },
  {
    "id": 19,
    "title": "Opna Women's Short Sleeve Moisture",
    "price": 7.95,
    "description": "100% Polyester, Machine wash, 100% cationic polyester interlock, Machine Wash & Pre Shrunk for a Great Fit, Lightweight, roomy and highly breathable with moisture wicking fabric which helps to keep moisture away, Soft Lightweight Fabric with comfortable V-neck collar and a slimmer fit, delivers a sleek, more feminine silhouette and Added Comfort",
    "category": "women's clothing",
    "image": "https://fakestoreapi.com/img/51eg55uWmdL._AC_UX679_.jpg",
    "rating": {
      "rate": 4.5,
      "count": 146
    }
  },
  {
    "id": 20,
    "title": "DANVOUY Womens T Shirt Casual Cotton Short",
    "price": 12.99,
    "description": "95%Cotton,5%Spandex, Features: Casual, Short Sleeve, Letter Print,V-Neck,Fashion Tees, The fabric is soft and has some stretch., Occasion: Casual/Office/Beach/School/Home/Street. Season: Spring,Summer,Autumn,Winter.",
    "category": "women's clothing",
    "image": "https://fakestoreapi.com/img/61pHAEJ4NML._AC_UX679_.jpg",
    "rating": {
      "rate": 3.6,
      "count": 145
    }
  },
  {
    "id": 21,
    "title": "GARUD SF SPECIAL EDITION HOODIE",
    "price": 1295,
    "description": "Our designs are crafted to showcase the courage within, enabling anyone to wear their valor with pride. Join us in honoring the adventurous spirit with apparel that’s as fearless as you are.We are super thrilled to bring to you our snow soft hoodies. All our hoodies are fleece knit which ensures the much desired cosy and warm feeling, we couple that with amazing durability and ever lasting prints making it the perfect hoodie. Hearty and Warm Fabric: Cafefully chosen for its perfect balance of warmth and comfort, embodying resilience for the bold adventurer.Snow Soft: Wrap yourself in the softness of serenity and the warmth of valor.Breathable Comfort: Freedom in movement, echoing the spirit of adventure. elaxed Fit: A fit for the fearless, ready for every challenge. Front Pouch Pocket: For the essentials on your journey, be it a quest or a quiet moment. Ribbed Cuffs and Hem: Tailored for a snug embrace, symbolizing the armor of modern-day warriors.Made in India: Proudly crafted, celebrating the skill and passion of our homeland. ",
    "category": "men's clothing",
    "image": "https://www.aeroarmour.store/cdn/shop/files/BigSizeHoodie14.jpg?v=1701785667&width=1800",
    "rating": {
      "rate": 4.3,
      "count": 850
    }
  },
  {
    "id": 23,
    "title": "Garmin Forerunner Watch",
    "price": 199.99,
    "description": "Our designs are crafted to showcase the courage within, enabling anyone to wear their valor with pride. Join us in honoring the adventurous spirit with apparel that’s as fearless as you are.We are super thrilled to bring to you our snow soft hoodies. All our hoodies are fleece knit which ensures the much desired cosy and warm feeling, we couple that with amazing durability and ever lasting prints making it the perfect hoodie. Hearty and Warm Fabric: Cafefully chosen for its perfect balance of warmth and comfort, embodying resilience for the bold adventurer.Snow Soft: Wrap yourself in the softness of serenity and the warmth of valor.Breathable Comfort: Freedom in movement, echoing the spirit of adventure. elaxed Fit: A fit for the fearless, ready for every challenge. Front Pouch Pocket: For the essentials on your journey, be it a quest or a quiet moment. Ribbed Cuffs and Hem: Tailored for a snug embrace, symbolizing the armor of modern-day warriors.Made in India: Proudly crafted, celebrating the skill and passion of our homeland.",
    "category": "electronics",
    "image": "https://www.gonoise.com/cdn/shop/files/NoiseColorFitUltra3-JetBlack_1.png?v=1695122756",
    "rating": {
      "rate": 4.2,
      "count": 570
    }
  },
  {
    "id": 24,
    "title": "Aerous Forerunner 233",
    "price": 199,
    "description": "GPS, Retina display, swimproof, optical heart sensor, stores music, podcasts, and audiobooks, elevation, Emergency SOS, S3 chip with dual-core processor, watchOS 6",
    "category": "men's clothing",
    "image": "https://m.media-amazon.com/images/I/51Hz7KZL2TL._SL1427_.jpg",
    "rating": {
      "rate": 4.5,
      "count": 570
    }
  },
  {
    "id": 25,
    "title": "Jewelery Filled with Sea Pearls",
    "price": 199.99,
    "description": "Better insights to reach your fitness goals get more out of every mile thanks to built-in pace coaching on the Galaxy Watch Active2: Its advanced sensors keep your pace to help you better achieve your run goals Comfortably sleek the Galaxy Watch Active2 is light enough to wear anywhere comfortably; It comes in aluminum or stainless steel and with a variety of faces, bands and finishes so it goes with anything Keep your beat: You can see if your heart rate is where you want it with Galaxy Watch Active2; Get automatically alerted if your watch detects a high or a low heart rate; This device and related software are not intended for use in the diagnosis of disease or other conditions, or in the cure, Mitigation, treatment or prevention of disease Level up your downtime; Galaxy Watch Active2’s built in sleep tracker offers valuable insights on how to get a better night’s sleep; It also monitors your stress level and helps you recently with the integrated calm app. This device and related software are not intended for use in the diagnosis of disease or other conditions, or in the cure, Mitigation, treatment or prevention of disease",
    "category": "jewelery",
    "image": "https://kinclimg3.bluestone.com/f_webp,c_scale,w_1024,b_rgb:f0f0f0/giproduct/BIVT0017P05_WAA18DIG6XXXXXXXX_ABCD00-PICS-00004-1024-15355.png",
    "rating": {
      "rate": 4.7,
      "count": 670
    }
  },
  {
    "id": 26,
    "title": "Neck Jewelry, Filled with Diamond and Gold",
    "price": 49.99,
    "description": "IP68 Waterproof Fitness Tracker Watch : YAMAY 023 is ip68 water-resistant, you can wear it when swimming.High sensitive large HD color screen make it easy to operate and give you clear insights to the display. 2020 New Update Fitness Tracker Smartwatch : It is with blood pressure monitor, heart rate monitor, sleep monitor, pedometer, calories counter, distance tracking, stopwatch, vibrating alarm clock, sedentary reminder, share tracker picture, incoming call and SMS reminder, Find phone etc. Fitness Watch for Men Women: If you want an all-in-one watch and don’t want to wear a bulky one, YAMAY 023 is the perfect one for you. Yamay 023 is with 9 sports mode(Press and hold the upper left button for 3 seconds to enter the sport mode),it can track your daily steps, calories burned, distance traveled and heart rate. Sleep Tracker with More Practical Tools: This fitness watch will auto detect and track your sleep,and analyze your sleep quality.You can easily check the data in the verfitpro app.This watch also has many pratical tools,like alarm clocks,music controller,deep breath guide,sedentary reminder,stopwatch,timer.",
    "category": "jewelery",
    "image": "https://kinclimg9.bluestone.com/f_webp,c_scale,w_1024,b_rgb:f0f0f0/giproduct/BIPO0772N29_YAA18DIG6PRWFXXXX_ABCD00-PICS-00003-1024-56331.png",
    "rating": {
      "rate": 4.3,
      "count": 350
    }
  },
  {
    "id": 27,
    "title": "Ring Jewelry, Filled with Diamond and Gold",
    "price": 89.99,
    "description": "Necklines can vary widely, from scoop necks to V-necks to boat necks, and each can influence how jewelry appears when worn with them. For example, a scoop neckline might allow for a statement necklace to be more prominently displayed, while a high neckline like a turtleneck might limit the amount of visible jewelry. The choice of neckline often depends on personal style preferences and the type of jewelry being worn.Necklines can vary widely, from scoop necks to V-necks to boat necks, and each can influence how jewelry appears when worn with them. For example, a scoop neckline might allow for a statement necklace to be more prominently displayed, while a high neckline like a turtleneck might limit the amount of visible jewelry. The choice of neckline often depends on personal style preferences and the type of jewelry being worn. ",
    "category": "jewelery",
    "image": "https://images.pexels.com/photos/998521/pexels-photo-998521.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1",
    "rating": {
      "rate": 4.4,
      "count": 620
    }
  },
  {
    "id": 28,
    "title": "Fitbit Inspire HR Heart Rate and Fitness Tracker",
    "price": 99.95,
    "description": "Utilize 24/7 heart rate to more accurately track calorie burn, resting heart rate & heart rate zones during workouts Track all-day activity, including steps, distance, hourly activity, active minutes and calories burned Automatically track sleep, plus due to the heart rate feature, get more insights into your light, deep & REM sleep stages Enjoy up to 5 days of battery for daily progress without constant charging. Varies with use and other factors Automatically and conveniently record workouts like walks, swimming & bike rides in a snap with SmartTrack",
    "category": "electronics",
    "image": "https://m.media-amazon.com/images/I/31h5vMziyqL._SX300_SY300_QL70_FMwebp_.jpg",
    "rating": {
      "rate": 4.6,
      "count": 530
    }
  },
  {
    "id": 29,
    "title": "LETSCOM Smart Watch Fitness Tracker",
    "price": 35.99,
    "description": "Heart Rate Monitoring & Sleep Tracking: Heart rate monitoring helps you understand your heart status during workouts. Our smartwatch also tracks your sleep automatically, measuring deep sleep, light sleep, and wake sleep to give you an analysis of your sleep patterns. Activity Tracking with 9 Sports Modes: Track your daily activity data like steps, calories, distance and minutes active and generate data charts on your device. You can also choose 9 sports modes to track your various workout accordingly. Call & Message Notifications: Get a clear display of calls, messages, and SNS notifications on your wrist and never miss important messages. Sedentary Reminder: Sitting too long? Your watch will remind you to stretch or walk around. This is especially useful if you have a desk job. More Practical Features: IP68 waterproof, support alarm clocks, music control, breath guide, timer. Perfect for Christmas gift, birthday, Thanksgiving，hiking, running, cycling, fitness etc.",
    "category": "electronics",
    "image": "https://m.media-amazon.com/images/I/41aZEFf+7LL._SY300_SX300_.jpg",
    "rating": {
      "rate": 4.1,
      "count": 870
    }
  },
  {
    "id": 30,
    "title": "Amazfit Bip Fitness Smartwatch, All-Day Heart Rate",
    "price": 79.99,
    "description": "45 Days Battery Life: Equipped with a lithium polymer battery with a 190mAh charge, you can use the Amazfit Bip up to 30 days on a single 2.5-hour charge. Reflective Always-On Display: The display is always on and easily readable under bright sunlight. The smartwatch features a reflective color display that's 1.28 inches and uses minimum power consumption, always-on, and can be seen clearly even under sunlight. 3 ATM Water Resistant: Designed to withstand all your activities, this smartwatch can resist water up to 30 meters. You can wear it while swimming, and it will track your movements and record them for further analysis. GPS Built-in: The Amazfit Bip comes with built-in GPS, which tracks your activities accurately, even if you leave your smartphone behind. You can see real-time stats such as pace, speed, distance, time elapsed, and more right on your wrist. 4 Sport Modes: The Bip is equipped with 4 sports modes: outdoor running, treadmill, cycling, and walking. It also tracks your steps, calories burned, distance traveled, and sleep quality to give you a comprehensive view of your health and fitness. Lightweight and Comfortable: The Amazfit Bip weighs only 32 grams with the strap, making it comfortable to wear all day long. The silicone strap is soft and hypoallergenic, making it suitable for even the most sensitive skin.",
    "category": "electronics",
    "image": "https://m.media-amazon.com/images/I/41jJtitW+KL._SY300_SX300_.jpg",
    "rating": {
      "rate": 4.3,
      "count": 1980
    }
  }
]
